app/Controllers/shop.php

    public function index()
    {
        $barang = $this->barang->select('barang.*, kategori.nama AS kategori')->join('kategori', 'barang.id_kategori=kategori.id')->findAll();
        $kategori = $this->kategori->findAll();
---
SELECT `barang`.*, `kategori`.`nama` AS `kategori`
FROM `barang`
JOIN `kategori` ON `barang`.`id_kategori`=`kategori`.`id`
SELECT *
FROM `kategori`

    public function product()
    {
        $id = $this->request->uri->getSegment(3);
        $diskon =  $this->diskon->findAll();
        $barang = $this->barang->find($id);
        $kategori = $this->kategori->findAll();
        $komentar = $this->komentar->select('komentar.*, user.username')->where('id_barang', $id)->join('user', 'komentar.id_user=user.id')->findAll();
---
SELECT *
FROM `diskon`
SELECT *
FROM `barang`
WHERE `barang`.`id` = '1'
SELECT *
FROM `kategori`
SELECT `komentar`.*, `user`.`username`
FROM `komentar`
JOIN `user` ON `komentar`.`id_user`=`user`.`id`
WHERE `id_barang` = '1'